richlegrand/psi_esp32/main/httpd_server.cpp
void WebRTCServer::websocketEventHandler(void* handler_args, esp_event_base_t base,
                                          int32_t event_id, void* event_data) {
    // Configure pthread to use PSRAM for the WebSocket client's task
    // This ensures PeerConnection creation (which spawns libjuice threads) uses PSRAM stacks
    // Call this once per event to ensure config is set (it's idempotent)
    esp32_ensure_pthread_psram();

    WebRTCServer* server = static_cast<WebRTCServer*>(handler_args);
    esp_websocket_event_data_t* data = static_cast<esp_websocket_event_data_t*>(event_data);

    switch (event_id) {
        case WEBSOCKET_EVENT_CONNECTED:
            ESP_LOGI(TAG, "WebSocket connected to signaling server");
            break;

        case WEBSOCKET_EVENT_DISCONNECTED:
            ESP_LOGI(TAG, "WebSocket disconnected");
            // TODO: Implement reconnection if needed
            break;

        case WEBSOCKET_EVENT_DATA:
            if (data->op_code == 0x01 && data->data_len > 0) {  // Text frame
                // Append received data to buffer
                server->ws_message_buffer_.append((char*)data->data_ptr, data->data_len);

                // Check if we have a complete JSON message
                bool is_complete = false;
                if (!server->ws_message_buffer_.empty() &&
                    server->ws_message_buffer_.front() == '{' &&
                    server->ws_message_buffer_.back() == '}') {
                    is_complete = true;
                }

                if (is_complete) {
                    ESP_LOGI(TAG, "Received complete WebSocket message (len=%d)",
                             (int)server->ws_message_buffer_.length());
                    server->handleWebSocketMessage(server->ws_message_buffer_);
                    server->ws_message_buffer_.clear();
                } else {
                    ESP_LOGD(TAG, "Received WebSocket fragment (len=%d), buffering...",
                             data->data_len);
                }
            }
            break;

        case WEBSOCKET_EVENT_ERROR:
            ESP_LOGE(TAG, "WebSocket error");
            break;

        default:
            break;
    }
}

void WebRTCServer::handleWebSocketMessage(const std::string& message) {
    cJSON* json = cJSON_Parse(message.c_str());
    if (!json) {
        ESP_LOGE(TAG, "Failed to parse signaling message");
        return;
    }

    cJSON* type_item = cJSON_GetObjectItem(json, "type");
    cJSON* client_id_item = cJSON_GetObjectItem(json, "client_id");

    if (!type_item || !cJSON_IsString(type_item)) {
        cJSON_Delete(json);
        return;
    }

    std::string type = type_item->valuestring;
    std::string client_id = (client_id_item && cJSON_IsString(client_id_item))
                            ? client_id_item->valuestring : "";

    if (type == "registered") {
        ESP_LOGI(TAG, "Registered! URL: https://%s/%s", server_url_.c_str(), uid_.c_str());
    } else if (type == "offer") {
        cJSON* sdp_item = cJSON_GetObjectItem(json, "sdp");
        if (sdp_item && cJSON_IsString(sdp_item)) {
            std::string sdp = sdp_item->valuestring;

            // Handle double-encoded SDP
            if (sdp.rfind("{\"type\":\"offer\"", 0) == 0) {
                cJSON* sub_json = cJSON_Parse(sdp.c_str());
                if (sub_json) {
                    cJSON* inner_sdp = cJSON_GetObjectItem(sub_json, "sdp");
                    if (inner_sdp && cJSON_IsString(inner_sdp)) {
                        sdp = inner_sdp->valuestring;
                    }
                    cJSON_Delete(sub_json);
                }
            }

            handleOffer(client_id, sdp);
        }
    } else if (type == "candidate") {
        cJSON* cand_item = cJSON_GetObjectItem(json, "candidate");
        if (cand_item) {
            cJSON* cand_str_item = cJSON_GetObjectItem(cand_item, "candidate");
            cJSON* mid_item = cJSON_GetObjectItem(cand_item, "sdpMid");

            if (cand_str_item && cJSON_IsString(cand_str_item) &&
                mid_item && cJSON_IsString(mid_item)) {
                std::string candidate = cand_str_item->valuestring;
                std::string mid = mid_item->valuestring;

                // Remove "candidate:" prefix if present
                if (candidate.rfind("candidate:", 0) == 0) {
                    candidate = candidate.substr(10);
                }

                handleCandidate(client_id, candidate, mid);
            }
        }
    }

    cJSON_Delete(json);
}

void WebRTCServer::handleOffer(const std::string& client_id, const std::string& sdp) {
    ESP_LOGI(TAG, "Received offer from client: %s", client_id.c_str());

    // Create PeerConnection with ICE servers
    Configuration config;
    config.iceServers.emplace_back("stun:stun.l.google.com:19302");
    // Add TURN servers if needed
    // config.iceServers.emplace_back("turn:...", port, "user", "pass", IceServer::RelayType::TurnUdp);

    auto pc = std::make_shared<PeerConnection>(config);

    // Store PeerConnection for later candidate additions
    {
        std::lock_guard<std::mutex> lock(sessions_mutex_);
        peer_connections_[client_id] = pc;
    }

    // Handle ICE candidates
    pc->onLocalCandidate([this, client_id](Candidate candidate) {
        ESP_LOGI(TAG, "New local candidate");

        cJSON* msg = cJSON_CreateObject();
        cJSON_AddStringToObject(msg, "type", "candidate");
        cJSON_AddStringToObject(msg, "client_id", client_id.c_str());

        cJSON* cand_obj = cJSON_CreateObject();
        std::string cand_str = "candidate:" + candidate.candidate();
        cJSON_AddStringToObject(cand_obj, "candidate", cand_str.c_str());
        cJSON_AddStringToObject(cand_obj, "sdpMid", candidate.mid().c_str());
        cJSON_AddNumberToObject(cand_obj, "sdpMLineIndex", 0);
        cJSON_AddItemToObject(msg, "candidate", cand_obj);

        char* msg_str = cJSON_PrintUnformatted(msg);
        if (msg_str) {
            sendSignalingMessage(msg_str);
            free(msg_str);
        }
        cJSON_Delete(msg);
    });

