richlegrand/psi_esp32/main/httpd_server.cpp
    // Handle local description (send answer)
    pc->onLocalDescription([this, client_id](Description description) {
        ESP_LOGI(TAG, "Local Description Ready (Answer)");

        cJSON* msg = cJSON_CreateObject();
        cJSON_AddStringToObject(msg, "type", "answer");
        cJSON_AddStringToObject(msg, "sdp", std::string(description).c_str());
        cJSON_AddStringToObject(msg, "client_id", client_id.c_str());

        char* msg_str = cJSON_PrintUnformatted(msg);
        if (msg_str) {
            sendSignalingMessage(msg_str);
            free(msg_str);
        }
        cJSON_Delete(msg);
    });

    // Handle DataChannel
    pc->onDataChannel([this, client_id, pc](std::shared_ptr<DataChannel> dc) {
        ESP_LOGI(TAG, "DataChannel opened for client: %s", client_id.c_str());

        auto session = std::make_shared<WebRTCSession>(client_id, pc, dc);

        dc->onMessage([session](std::variant<rtc::binary, std::string> data) {
            if (std::holds_alternative<rtc::binary>(data)) {
                session->handleSwspFrame(std::get<rtc::binary>(data));
            }
        });

        dc->onClosed([this, client_id]() {
            ESP_LOGI(TAG, "DataChannel closed for client: %s", client_id.c_str());
            removeSession(client_id);
        });

        addSession(client_id, session);
    });

    // Set remote description (this triggers answer creation)
    pc->setRemoteDescription(Description(sdp, "offer"));
}

void WebRTCServer::handleCandidate(const std::string& client_id, const std::string& candidate,
                                    const std::string& mid) {
    ESP_LOGI(TAG, "Received candidate from client: %s", client_id.c_str());

    std::shared_ptr<PeerConnection> pc;
    {
        std::lock_guard<std::mutex> lock(sessions_mutex_);
        auto it = peer_connections_.find(client_id);
        if (it == peer_connections_.end()) {
            ESP_LOGE(TAG, "No PeerConnection found for client: %s", client_id.c_str());
            return;
        }
        pc = it->second;
    }

    try {
        pc->addRemoteCandidate(Candidate(candidate, mid));
        ESP_LOGI(TAG, "Added remote candidate");
    } catch (const std::exception& e) {
        ESP_LOGE(TAG, "Failed to add candidate: %s", e.what());
    }
}

void WebRTCServer::sendSignalingMessage(const std::string& message) {
    if (!ws_client_ || !esp_websocket_client_is_connected(ws_client_)) {
        ESP_LOGE(TAG, "WebSocket not connected");
        return;
    }

    ESP_LOGI(TAG, "Sending signaling message, len=%d", (int)message.length());
    int ret = esp_websocket_client_send_text(ws_client_, message.c_str(), message.length(), portMAX_DELAY);
    if (ret < 0) {
        ESP_LOGE(TAG, "Failed to send signaling message, ret=%d", ret);
    }
}

void WebRTCServer::addSession(const std::string& client_id, std::shared_ptr<WebRTCSession> session) {
    std::lock_guard<std::mutex> lock(sessions_mutex_);
    if (sessions_.size() >= MAX_SESSIONS) {
        ESP_LOGE(TAG, "Max sessions reached, rejecting client: %s", client_id.c_str());
        return;
    }
    sessions_[client_id] = session;
    session->setHandlers(&uri_handlers_);
    ESP_LOGI(TAG, "Session added: %s (total: %d)", client_id.c_str(), (int)sessions_.size());
}

void WebRTCServer::removeSession(const std::string& client_id) {
    std::lock_guard<std::mutex> lock(sessions_mutex_);
    auto it = sessions_.find(client_id);
    if (it != sessions_.end()) {
        sessions_.erase(it);
        ESP_LOGI(TAG, "Session removed: %s (total: %d)", client_id.c_str(), (int)sessions_.size());
    }
    // Also remove PeerConnection
    auto pc_it = peer_connections_.find(client_id);
    if (pc_it != peer_connections_.end()) {
        peer_connections_.erase(pc_it);
    }
}

std::shared_ptr<WebRTCSession> WebRTCServer::getSession(const std::string& client_id) {
    std::lock_guard<std::mutex> lock(sessions_mutex_);
    auto it = sessions_.find(client_id);
    return (it != sessions_.end()) ? it->second : nullptr;
}

esp_err_t WebRTCServer::registerHandler(const httpd_uri_t* uri_handler) {
    if (!uri_handler) {
        return ESP_ERR_INVALID_ARG;
    }

    // Check for duplicates
    for (const auto& h : uri_handlers_) {
        if (strcmp(h.uri, uri_handler->uri) == 0 && h.method == uri_handler->method) {
            return ESP_ERR_HTTPD_HANDLER_EXISTS;
        }
    }

    uri_handlers_.push_back(*uri_handler);
    ESP_LOGI(TAG, "Registered handler: %s", uri_handler->uri);
    return ESP_OK;
}

void WebRTCServer::start() {
    ESP_LOGI(TAG, "Starting WebRTCServer...");

    // Initialize handler dispatcher with Internal RAM stack (for file I/O)
    HandlerDispatcher::Instance().initialize();

    running_ = true;

    // Build WebSocket URL
    std::string ws_url = "wss://" + server_url_ + "/ws/device/" + uid_;

    esp_websocket_client_config_t websocket_cfg = {};
    websocket_cfg.uri = ws_url.c_str();
    // 32KB stack: Required for regex-based SDP parsing in libdatachannel
    // (complex RFC 3986 URL regex causes deep recursion)
    // Parent project dispatches SDP parsing to MainThread to avoid this
    websocket_cfg.task_stack = 32768;
    websocket_cfg.buffer_size = 2048;  // 2KB buffer

    // TLS configuration for secure WebSocket (WSS)
    // Use ESP-IDF's certificate bundle for CA verification
    websocket_cfg.crt_bundle_attach = esp_crt_bundle_attach;

    ESP_LOGI(TAG, "Connecting to: %s", ws_url.c_str());

    ws_client_ = esp_websocket_client_init(&websocket_cfg);
    if (!ws_client_) {
        ESP_LOGE(TAG, "Failed to initialize WebSocket client");
        return;
    }

    esp_websocket_register_events(ws_client_, WEBSOCKET_EVENT_ANY, websocketEventHandler, this);
    esp_websocket_client_start(ws_client_);
}

void WebRTCServer::stop() {
    ESP_LOGI(TAG, "Stopping WebRTCServer...");

    running_ = false;

    // Close all sessions
    {
        std::lock_guard<std::mutex> lock(sessions_mutex_);
        sessions_.clear();
        peer_connections_.clear();
    }

