richlegrand/psi_esp32/main/httpd_server.cpp
esp_err_t httpd_req_get_hdr_value_str(httpd_req_t *r, const char *field, char *val, size_t val_size) {
    if (!r || !r->aux || !field || !val) {
        return ESP_ERR_INVALID_ARG;
    }
    auto aux = static_cast<httpd_req_aux*>(r->aux);
    auto it = aux->headers.find(field);
    if (it != aux->headers.end()) {
        strncpy(val, it->second.c_str(), val_size - 1);
        val[val_size - 1] = '\0';
        return ESP_OK;
    }
    return ESP_ERR_NOT_FOUND;
}

size_t httpd_req_get_url_query_len(httpd_req_t *r) {
    // TODO: implement query string parsing
    return 0;
}

esp_err_t httpd_req_get_url_query_str(httpd_req_t *r, char *buf, size_t buf_len) {
    // TODO: implement query string parsing
    return ESP_ERR_NOT_FOUND;
}

esp_err_t httpd_query_key_value(const char *qry, const char *key, char *val, size_t val_size) {
    // TODO: implement query string parsing
    return ESP_ERR_NOT_FOUND;
}

int httpd_req_recv(httpd_req_t *r, char *buf, size_t buf_len) {
    if (!r || !r->aux || !buf) {
        return -1;
    }
    auto aux = static_cast<httpd_req_aux*>(r->aux);
    size_t copy_len = std::min(buf_len, aux->body.size());
    if (copy_len > 0) {
        memcpy(buf, aux->body.data(), copy_len);
    }
    return (int)copy_len;
}

} // extern "C"

//=============================================================================
// Handler Dispatcher Implementation
//=============================================================================

void HandlerDispatcher::initialize() {
    if (initialized_) {
        ESP_LOGW(TAG, "HandlerDispatcher already initialized");
        return;
    }

    // Create request queue (depth of 4 allows some pipelining)
    request_queue_ = xQueueCreate(4, sizeof(HandlerRequest*));
    if (!request_queue_) {
        ESP_LOGE(TAG, "Failed to create handler dispatcher queue");
        return;
    }

    // Create handler task with Internal RAM stack
    // CRITICAL: Must use Internal RAM because this task does file I/O (LittleFS)
    // When flash is accessed, cache is disabled, and PSRAM stacks become inaccessible!
    // Stack size: 16KB should be sufficient for file I/O operations
    // Priority: 5 (same as WebSocket task) for responsive HTTP handling
    BaseType_t ret = xTaskCreate(
        handlerTaskEntry,
        "http_handler",
        16384,  // 16KB stack in Internal RAM
        this,
        5,      // Priority
        &handler_task_
    );

    if (ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create handler dispatcher task");
        vQueueDelete(request_queue_);
        request_queue_ = nullptr;
        return;
    }

    initialized_ = true;
    ESP_LOGI(TAG, "Handler dispatcher initialized (16KB Internal RAM stack)");
}

void HandlerDispatcher::handlerTaskEntry(void* arg) {
    HandlerDispatcher* self = static_cast<HandlerDispatcher*>(arg);
    self->handlerTaskLoop();
}

void HandlerDispatcher::handlerTaskLoop() {
    ESP_LOGI(TAG, "Handler dispatcher task started");

    while (true) {
        HandlerRequest* req = nullptr;

        // Wait for handler request
        if (xQueueReceive(request_queue_, &req, portMAX_DELAY) == pdTRUE && req) {
            // Execute the handler
            req->result = req->handler->handler(req->req);

            // Signal completion
            xSemaphoreGive(req->completion_sem);
        }
    }
}

esp_err_t HandlerDispatcher::executeHandler(httpd_req_t* req, const httpd_uri_t* handler) {
    if (!initialized_ || !request_queue_) {
        ESP_LOGE(TAG, "Handler dispatcher not initialized");
        return ESP_FAIL;
    }

    // Create completion semaphore
    SemaphoreHandle_t completion_sem = xSemaphoreCreateBinary();
    if (!completion_sem) {
        ESP_LOGE(TAG, "Failed to create completion semaphore");
        return ESP_FAIL;
    }

    // Create request
    HandlerRequest request = {
        .req = req,
        .handler = handler,
        .completion_sem = completion_sem,
        .result = ESP_FAIL
    };

    HandlerRequest* req_ptr = &request;

    // Send to dispatcher task
    if (xQueueSend(request_queue_, &req_ptr, pdMS_TO_TICKS(5000)) != pdTRUE) {
        ESP_LOGE(TAG, "Failed to queue handler request (timeout)");
        vSemaphoreDelete(completion_sem);
        return ESP_FAIL;
    }

    // Wait for completion (timeout after 30 seconds for large file transfers)
    if (xSemaphoreTake(completion_sem, pdMS_TO_TICKS(30000)) != pdTRUE) {
        ESP_LOGE(TAG, "Handler execution timeout");
        vSemaphoreDelete(completion_sem);
        return ESP_FAIL;
    }

    esp_err_t result = request.result;
    vSemaphoreDelete(completion_sem);

    return result;
}
